aaron-bond.better-comments
adpyke.codesnap
ahmadawais.shades-of-purple
akamud.vscode-theme-onedark
anthropic.claude-code
christian-kohler.path-intellisense
connorabbas.github-dark-palenight
dphans.micropython-ide-vscode
dracula-theme.theme-dracula
eamodio.gitlens
editorconfig.editorconfig
eliverlara.andromeda
esbenp.prettier-vscode
ethansk.restore-terminals
github.vscode-github-actions
github.vscode-pull-request-github
gruntfuggly.todo-tree
hashicorp.terraform
hoovercj.vscode-power-mode
ijustdev.gitea-vscode
lintangwisesa.arduino
miguelsolorio.fluent-icons
moozzyk.arduino
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-edgedevtools.vscode-edge-devtools
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-chat-customizations-evaluations
pkief.material-icon-theme
platformio.platformio-ide
redhat.ansible
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
ryanolsonx.poimandres-ocean
sallar.vscode-duotone-dark
solarliner.linux-themes
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
terencecarrera.gitea
tomoki1207.pdf
usernamehw.errorlens
vscode-icons-team.vscode-icons
vscodevim.vim
youssef.viow
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
